"bad"
"worst"
"great"
"waste"
"awful"
"excellent"
"terrible"
"worse"
"boring"
"wonderful"
"best"
"no"
"stupid"
"of_best"
"nothing"
"waste_of"
"poor"
"horrible"
"one_of_best"
"of_worst"
"minutes"
"even"
"so_bad"
"just"
"love"
"crap"
"supposed"
"one_of_worst"
"acting"
"poorly"
"perfect"
"at_all"
"why"
"plot"
"loved"
"script"
"ridiculous"
"amazing"
"lame"
"beautiful"
"worst_movie"
"avoid"
"superb"
"well"
"favorite"
"wasted"
"brilliant"
"not_even"
"annoying"
"oh"
"dull"
"mess"
"pointless"
"money"
"laughable"
"any"
"highly"
"cheap"
"life"
"pathetic"
"must_see"
"also"
"least"
"badly"
"fantastic"
"unless"
"very"
"instead"
"beautifully"
"one_of"
"could"
"1"
"fails"
"2"
"redeeming"
"garbage"
"both"
"today"
"only"
"always"
"couldn't"
"very_well"
"performance"
"enjoyed"
"really_bad"
"bad_movie"
"performances"
"than_this"
"anything"
"how_bad"
"well_worth"
"reason"
"avoid_this"
"sorry"
"save"
"didn't"
"highly_recommend"
"minutes_of"
"years"
"looks_like"
"this_great"
"off"
"8_10"
"touching"
"10_10"
"to_make"
"predictable"
"wonderfully"
"outstanding"
"decent"
"bother"
"unfortunately"
"this_piece_of"
"to_be"
"world"
"sit_through"
"no_sense"
"perfectly"
"highly_recommended"
"strong"
"not_worth"
"3"
"excuse"
"7_10"
"this_piece"
"not_funny"
"4_10"
"guess"
"powerful"
"ok"
"8"
"dumb"
"4"
"whatsoever"
"definitely"
"looks"
"of_crap"
"better"
"terrific"
"low"
"nothing_to"
"attempt"
"3_10"
"unfunny"
"classic"
"unique"
"would"
"absolutely_no"
"love_this"
"story_of"
"especially"
"still"
"gem"
"mean"
"to_sit_through"
"look_like"
"idea"
"amateurish"
"none_of"
"7"
"own"
"wooden"
"wasn't"
"sucks"
"don't_even"
"heart"
"half"
"joke"
"job"
"either"
"true"
"this_crap"
"bunch_of"
"masterpiece"
"9_10"
"trash"
"lousy"
"subtle"
"disappointment"
"recommended"
"different"
"1_10"
"only_good"
"great_movie"
"apparently"
"very_good"
"loved_this"
"gives"
"dreadful"
"watching_this"
"disappointing"
"mediocre"
"delightful"
"very_bad"
"atrocious"
"rubbish"
"great_job"
"someone"
"great_film"
"underrated"
"painful"
"brilliantly"
"bad_but"
"attempt_at"
"each"
"hour"
"greatest"
"bored"
"stunning"
"only_reason"
"on_dvd"
"performance_as"
"just_plain"
"could_been"
"money_on"
"incredible"
"watching"
"not_good"
"remotely"
"wrong"
"enjoyable"
"weak"
"or_something"
"well_done"
"should"
"this_thing"
"insult"
"captures"
"bland"
"looked"
"this_mess"
"hilarious"
"save_this"
"completely"
"problem"
"works"
"will"
"1_out"
"war"
"wasting"
"finest"
"embarrassing"
"fun"
"tedious"
"costs"
"shows"
"be_funny"
"crappy"
"memorable"
"oscar"
"moving"
"2_10"
"highly_recommend_this"
"family"
"definitely_worth"
"doesn't_even"
"it's_just"
"uninteresting"
"movie_just"
"okay"
"unbelievable"
"as_if"
"just_bad"
"trying"
"lives"
"magnificent"
"bad_this"
"solid"
"failed"
"beauty"
"only_thing"
"friendship"
"refreshing"
"first_saw"
"sweet"
"silly"
"simple"
"no_plot"
"stinker"
"but_this"
"journey"
"realistic"
"time_money"
"well_written"
"flat"
"may_not"
"pile"
"this_just"
"many"
"unconvincing"
"why_did"
"dialogue"
"forgettable"
"uninspired"
"rare"
"much_better"
"if_want"
"emotions"
"maybe"
"existent"
"insult_to"
"top_notch"
"remarkable"
"any_of"
"pretty_bad"
"enjoy"
"incoherent"
"first_time"
"only_good_thing"
"complex"
"skip_this"
"recommend"
"with_this"
"extraordinary"
"way_too"
"fascinating"
"0"
"absolutely_nothing"
"music"
"rip_off"
"awesome"
"unwatchable"
"4_out_of_10"
"horribly"
"this_excellent"
"through_this"
"idiotic"
"miserably"
"one_of_most"
"perfection"
"nowhere"
"played"
"plays"
"tried"
"portrayal"
"except"
"3_out_of_10"
"of_most"
"tale"
"human"
"unforgettable"
"stay_away"
"random"
"7_out_of"
"wouldn't"
"7_out"
"lack_of"
"notch"
"fine"
"enjoyed_this"
"favourite"
"barely"
"see_for"
"if_want_to"
"looked_like"
"seconds"
"isn't_even"
"write"
"drivel"
"cliché"
"dvd"
"charming"
"at_same"
"mildly"
"would_been"
"so_well"
"fast_forward"
"intense"
"lack"
"seemed"
"junk"
"rent"
"flawless"
"asleep"
"irritating"
"2_out_of_10"
"no_real"
"honestly"
"brings"
"superbly"
"premise"
"mst3k"
"spent"
"experience"
"utter"
"8_out"
"embarrassed"
"romantic"
"series"
"what_makes"
"favorites"
"breathtaking"
"boredom"
"gore"
"this_turkey"
"hours_of_life"
"poignant"
"it's_great"
"love_this_movie"
"8_out_of"
"hoping"
"can't_believe"
"gorgeous"
"10_out"
"inept"
"would_be"
"movie_great"
"relationship"
"make_movie"
"very_funny"
"helps"
"most"
"some_kind_of"
"paid"
"90_minutes"
"appalling"
"just_didn't"
"10_out_of_10"
"this_supposed"
"first_saw_this"
"supposedly"
"horrid"
"for_first_time"
"although"
"nonsense"
"funniest"
"if_this"
"good_as"
"clichéd"
"9"
"very_different"
"that's_about"
"attempt_to"
"only_redeeming"
"obvious"
"2_out"
"rented"
"not_recommend"
"lacks"
"stupidity"
"shallow"
"pretentious"
"just_not"
"god"
"excellent_film"
"at_time"
"camera"
"basically"
"effort"
"turkey"
"even_that"
"timeless"
"whole_movie"
"marvelous"
"makes"
"ashamed"
"doesn't_work"
"pleasantly_surprised"
"later"
"atmosphere"
"let's"
"unexpected"
"insulting"
"sucked"
"sat_through"
"save_money"
"looking"
"this_movie_so_bad"
"don't_miss"
"edge"
"come_on"
"unlike"
"effective"
"liked"
"first_rate"
"exceptional"
"b_movie"
"not_that"
"wonderful_film"
"may"
"delight"
"10_minutes"
"see_again"
"very_entertaining"
"minutes_into"
"feelings"
"not_enough"
"noir"
"any_of_characters"
"about_as"
"ludicrous"
"tripe"
"haunting"
"couldn't_even"
"new"
"city"
"to_see_again"
"thing_about"
"gripping"
"did"
"who"
"provides"
"clichés"
"meets"
"worthless"
"grade"
"of_seat"
"rest"
"quite"
"for_everyone"
"suppose"
"understated"
"disaster"
"care"
"money_back"
"recommend_this"
"cardboard"
"freedom"
"tries_to_be"
"tragic"
"perfect_as"
"useless"
"impressed"
"do_not"
"writing"
"unintentional"
"potential"
"appreciated"
"walked_out"
"of_war"
"natural"
"nicely"
"may_not_be"
"neither"
"really_enjoyed"
"unintentionally"
"little_to"
"treat"
"care_about"
"ugly"
"available"
"society"
"adds"
"wonder"
"thin"
"very_disappointed"
"fabulous"
"rip_off_of"
"writers"
"tears"
"most_boring"
"episodes"
"can't_wait"
"just_right"
"often"
"mystery_science"
"best_film"
"believable"
"crafted"
"disappointed"
"9_out_of_10"
"just_doesn't"
"downhill"
"wanted_to_like"
"but_fails"
"do_not_watch_this"
"acting_great"
"gritty"
"great_acting"
"going_for"
"ways"
"on_on"
"very_enjoyable"
"below_average"
"should_been"
"screaming"
"world_of"
"endless"
"sub_par"
"entertaining"
"just_great"
"nudity"
"unnecessary"
"this_one_of"
"score"
"of_fun"
"below"
"compelling"
"genius"
"of_funniest"
"be_missed"
"unusual"
"today's"
"miscast"
"thanks"
"cover"
"easy"
"if_had"
"for_this"
"far_too"
"this_best"
"tells"
"just_isn't"
"skip"
"that_would"
"ages"
"more_like"
"shoot"
"what_point"
"be_good"
"others"
"obnoxious"
"moronic"
"as_good"
"sadness"
"so_called"
"to_write"
"what_thinking"
"producers"
"watchable"
"continuity"
"favorite_movies"
"grade_d"
"original"
"recently"
"saw_this"
"of_human"
"nevertheless"
"fresh"
"vhs"
"even_get"
"become"
"performances_by"
"no_story"
"rest_of_movie"
"beautiful_film"
"zombies"
"embarrassment"
"pitiful"
"surprised"
"trite"
"happiness"
"should_never"
"deeply"
"for_those"
"for_free"
"warm"
"sensitive"
"like_bad"
"save_yourself"
"sex"
"actors"
"attempts_at"
"if_want_to_see"
"nature"
"dimensional"
"dreck"
"to_all"
"t"
"walked"
"like_watching"
"not_perfect"
"absurd"
"bore"
"don't_watch_this"
"bothered"
"surprisingly"
"delivers"
"sitting_through"
"appreciate"
"too_many"
"be_comedy"
"only_saving"
"adds_to"
"keeps"
"those_who"
"best_movie"
"ruined"
"late"
"yawn"
"ever"
"heartbreaking"
"at_first"
"ripped"
"alright"
"kidding"
"disgusting"
"truly"
"promising"
"sometimes"
"spectacular"
"very_little"
"seemed_to"
"how_not_to"
"felt_like"
"really_wanted"
"rented_this"
"important"
"brought"
"day"
"jean"
"not_very"
"chilling"
"splendid"
"this_very"
"quiet"
"confusing"
"touches"
"unrealistic"
"viewing"
"masterful"
"growing_up"
"that_will"
"doesn't_make"
"seems"
"sadly"
"terribly"
"fell_asleep"
"didn't_care"
"times"
"holds"
"otherwise"
"excellently"
"riveting"
"disjointed"
"thoroughly_enjoyed"
"not_be"
"shows_how"
"at_best"
"happy"
"overlooked"
"dire"
"season"
"tremendous"
"satisfying"
"meaningless"
"sense_of"
"muddled"
"trying_to_be"
"hooked"
"would_love_to"
"easy_to"
"recommend_to"
"very_moving"
"turd"
"doing"
"unlikeable"
"released"
"can_relate"
"sort"
"see"
"how_not"
"lot_of_fun"
"joy_to"
"stock_footage"
"feel_good"
"chance"
"stick_to"
"no_chemistry"
"as_good_as"
"two_hours"
"sake"
"paint"
"stinks"
"paper"
"one_dimensional"
"traditional"
"steals_show"
"thought_provoking"
"pleasure"
"why_do"
"would_not_recommend"
"so_real"
"viewings"
"small"
"on_edge_of"
"definitely_recommend"
"power_of"
"courage"
"to_be_missed"
"say_about"
"in_movie"
"steals"
"deals_with"
"just_too"
"had_high"
"fast_paced"
"what_point_of"
"project"
"embarrassingly"
"without_any"
"strength"
"filmmakers"
"entire"
"incomprehensible"
"at_times"
"images"
"surprising"
"takes"
"together"
"portrait"
"soundtrack"
"in_lives"
"dreams"
"doesn't_help"
"not_much"
"seagal"
"this_gem"
"this_very_good"
"reality"
"touched"
"walking_around"
"offensive"
"to_believe"
"impact"
"just_wasn't"
"lifeless"
"bit"
"moved"
"repetitive"
"interesting_but"
"performances_of"
"abomination"
"not_make"
"potential_but"
"must_for"
"cash_in"
"film_very"
"not_very_good"
"raw"
"one_star"
"this_junk"
"hated"
"of_this_movie"
"bottom_of"
"very_real"
"not_one"
"did_this"
"impressive"
"going_to"
"touch"
"not_recommended"
"thrown"
"f"
"future"
"accent"
"eerie"
"advice"
"also_good"
"story_told"
"pleasant"
"hackneyed"
"insipid"
"about_any_of"
"everyday"
"light"
"carries"
"made_this"
"bottom_of_barrel"
"of_barrel"
"matthau"
"film_school"
"explores"
"ed_wood"
"sharp"
"bin"
"blah"
"unintentionally_funny"
"simplicity"
"even_better"
"generic"
"only_complaint"
"fell_in"
"wrenching"
"inappropriate"
"lacked"
"shelf"
"could_been_good"
"out"
"surreal"
"witty"
"lazy"
"miss_this"
"but_why"
"frank"
"very_disappointing"
"on_plus_side"
"follows"
"it's_very"
"only_positive"
"wasn't_funny"
"lackluster"
"portrait_of"
"bothered_to"
"positive"
"fails_on"
"engrossing"
"delightfully"
"give_break"
"top"
"no_wonder"
"innocent"
"heart_warming"
"yet"
"1_2_from"
"scientist"
"some_guy"
"didn't_work"
"from_outer_space"
"twists_turns"
"lacking"
"tender"
"would_recommend"
"release"
"movie_only"
"olds"
"give_1"
"sees"
"tiresome"
"blend_of"
"this_travesty"
"comedies"
"episode"
"unfolds"
"hard_to_be"
"who_made_this"
"really_good"
"really_liked"
"consequences"
"work_of"
"inspiring"
"tasteless"
"stands"
"james_stewart"
"to_care"
"failure"
"main_problem"
"thumbs_up"
"best_of_all"
"even_close"
"if_director"
"called"
"cried"
"simply"
"but_still"
"little_film"
"call_that"
"film_just"
"i'm_afraid"
"black_white"
"problem_that"
"older"
"illogical"
"this_movie_nothing"
"french"
"to_believe_that"
"to_recommend"
"spent_on"
"biggest_problem"
"mesmerizing"
"know"
"not_enough_to"
"something_better"
"ideal"
"for_all_ages"
"so_predictable"
"some_good"
"annoyed"
"brutal"
"outer_space"
"to_work_with"
"cleverly"
"intelligent"
"oh_wait"
"saving"
"generous"
"astonishing"
"value"
"might_been"
"enjoyable_film"
"throwing"
"won't_be_disappointed"
"any_real"
"downhill_from"
"watch_over_over"
"this_movie_had"
"movie_could_been"
"wretched"
"tired"
"tolerable"
"wouldn't_recommend"
"film_excellent"
