"bad"
"worst"
"great"
"waste"
"awful"
"terrible"
"excellent"
"worse"
"best"
"of_best"
"wonderful"
"waste_of"
"no"
"boring"
"of_worst"
"nothing"
"poor"
"one_of_best"
"minutes"
"horrible"
"stupid"
"even"
"acting"
"so_bad"
"one_of_worst"
"supposed"
"at_all"
"poorly"
"perfect"
"crap"
"love"
"just"
"why"
"ridiculous"
"avoid"
"plot"
"superb"
"amazing"
"loved"
"beautiful"
"well"
"not_even"
"favorite"
"lame"
"brilliant"
"wasted"
"script"
"life"
"worst_movie"
"money"
"must_see"
"cheap"
"pointless"
"thing"
"highly"
"oh"
"also"
"annoying"
"any"
"dull"
"very"
"laughable"
"unless"
"pathetic"
"mess"
"fantastic"
"least"
"badly"
"one_of"
"fails"
"reason"
"performance"
"beautifully"
"both"
"always"
"at_least"
"avoid_this"
"garbage"
"enjoyed"
"instead"
"how_bad"
"wonderfully"
"redeeming"
"very_well"
"1"
"well_worth"
"8_10"
"bad_movie"
"today"
"could"
"highly_recommend"
"strong"
"this_great"
"really_bad"
"performances"
"make"
"sorry"
"only"
"didn't"
"minutes_of"
"2"
"looks_like"
"touching"
"bother"
"couldn't"
"10_10"
"save"
"ok"
"no_sense"
"years"
"anything"
"7_10"
"excuse"
"this_piece_of"
"predictable"
"powerful"
"highly_recommended"
"8"
"perfectly"
"definitely"
"decent"
"to_make"
"terrific"
"all_costs"
"dumb"
"would"
"at_all_costs"
"off"
"moving"
"not_funny"
"attempt"
"low"
"gives"
"unfortunately"
"gem"
"3"
"outstanding"
"better"
"nothing_to"
"lousy"
"4_10"
"unique"
"4"
"guess"
"this_piece"
"than_this"
"hilarious"
"don't_even"
"love_this"
"3_10"
"looks"
"not_worth"
"whatsoever"
"stunning"
"to_be"
"world"
"masterpiece"
"with_great"
"7"
"brilliantly"
"as_well_as"
"own"
"story_of"
"idea"
"look_like"
"sucks"
"half"
"incredible"
"different"
"just_plain"
"unfunny"
"sit_through"
"watching_this"
"disappointing"
"subtle"
"hour"
"amateurish"
"loved_this"
"none_of"
"true"
"atrocious"
"great_film"
"performance_as"
"delightful"
"absolutely_no"
"mediocre"
"wooden"
"joke"
"dreadful"
"especially"
"very_good"
"classic"
"disappointment"
"watching"
"to_sit_through"
"job"
"this_crap"
"completely"
"beauty"
"rubbish"
"will"
"captures"
"bunch_of"
"painful"
"attempt_at"
"great_job"
"underrated"
"oscar"
"trash"
"insult"
"remotely"
"lives"
"only_thing"
"heart"
"this_thing"
"or_something"
"very_bad"
"great_movie"
"on_dvd"
"effects"
"trying"
"bad_this"
"still"
"each"
"weak"
"solid"
"insult_to"
"this_just"
"shows"
"should"
"1_10"
"recommended"
"wrong"
"piece_of"
"bored"
"only_good"
"flat"
"friendship"
"simple"
"sweet"
"9_10"
"not_good"
"memorable"
"rare"
"save_this"
"apparently"
"top_notch"
"problem"
"well_written"
"many"
"crappy"
"looked"
"complex"
"pile"
"could_been"
"unconvincing"
"this_mess"
"embarrassing"
"existent"
"1_out"
"greatest"
"someone"
"played"
"finest"
"2_10"
"highly_recommend_this"
"definitely_worth"
"journey"
"bad_but"
"bland"
"fun"
"either"
"uninspired"
"works"
"tedious"
"best_of"
"stinker"
"wasting"
"much_better"
"first_saw"
"well_done"
"bad_film"
"absolutely_nothing"
"supposedly"
"4_out_of_10"
"may_not"
"enjoy"
"tale"
"uninteresting"
"enjoyed_this"
"0"
"emotions"
"complete"
"enjoyable"
"magnificent"
"isn't_even"
"barely"
"i'm_sorry"
"breathtaking"
"write"
"seconds"
"but_this"
"as_if"
"time_money"
"refreshing"
"if_want"
"first_time"
"unlike"
"any_of"
"through_this"
"extraordinary"
"if_want_to"
"4_out"
"even_that"
"seemed"
"charming"
"this_wonderful"
"recommend"
"okay"
"asleep"
"clichéd"
"fascinating"
"perfection"
"music"
"horribly"
"if_this"
"silly"
"lack_of"
"makes"
"favorites"
"this_turkey"
"it's_just"
"movie_just"
"realistic"
"dialogue"
"skip_this"
"awesome"
"3_out_of_10"
"except"
"way_too"
"natural"
"very_funny"
"any_sense"
"unexpected"
"at_same"
"doesn't"
"why_did"
"incoherent"
"superbly"
"wouldn't"
"gore"
"experience"
"series"
"unwatchable"
"fast_forward"
"rented"
"don't_bother"
"junk"
"stay_away"
"nonsense"
"rent"
"failed"
"minutes_of_life"
"would_be"
"cliché"
"unbelievable"
"relationship"
"can't_believe"
"timeless"
"human"
"make_movie"
"of_war"
"only_good_thing"
"at_time"
"embarrassed"
"irritating"
"forgettable"
"feelings"
"they're"
"come_on"
"thinking"
"mildly"
"of_most"
"satisfying"
"would_been"
"unforgettable"
"favourite"
"edge"
"this_excellent"
"8_out"
"minutes_into"
"hoping"
"idiotic"
"enough"
"movie_great"
"7_out_of"
"first_saw_this"
"impressed"
"brings"
"7_out"
"attempt_to"
"paid"
"but_fails"
"exceptional"
"good_as"
"marvelous"
"no_real"
"worthless"
"7_out_of_10"
"just_not"
"new"
"quite"
"mst3k"
"love_this_movie"
"don't_miss"
"whole_thing"
"memories"
"five_minutes"
"gorgeous"
"flawless"
"point"
"gritty"
"but_no"
"this_movie_so_bad"
"adds"
"effective"
"horrid"
"adds_to"
"whole_movie"
"drivel"
"fine"
"funniest"
"doesn't_work"
"tells"
"delight"
"atmosphere"
"see_again"
"with_no"
"inept"
"sucked"
"available"
"not_watch"
"appalling"
"dvd"
"grade"
"clichés"
"this_horrible"
"turkey"
"not_recommend"
"for_everyone"
"excellent_film"
"to_write"
"straight_to"
"basically"
"10_out"
"even_worth"
"10_out_of_10"
"first_rate"
"should_been"
"useless"
"any_of_characters"
"also_great"
"wonderful_film"
"might"
"that's_about"
"released"
"very_entertaining"
"really_enjoyed"
"insulting"
"lacks"
"save_money"
"of_seat"
"some_kind_of"
"recommend_this"
"downhill"
"pleasantly_surprised"
"often"
"hooked"
"city"
"times"
"most_boring"
"entertaining"
"2_out_of_10"
"stupidity"
"haunting"
"live"
"truly"
"rip_off_of"
"nicely"
"intense"
"killed"
"zombies"
"happiness"
"movie_sucks"
"sharp"
"obnoxious"
"tripe"
"nudity"
"what_makes"
"be_missed"
"lovely"
"ludicrous"
"small"
"honestly"
"rest"
"just_isn't"
"does_great_job"
"later"
"writers"
"not_that"
"trying_to_be"
"most"
"rented_this"
"tears"
"more_like"
"nothing_in"
"moved"
"makes_this"
"noir"
"little_to"
"at_times"
"liked"
"warm"
"treat"
"this_movie_bad"
"shallow"
"crafted"
"boredom"
"favorite_movies"
"suppose"
"endless"
"although"
"that_would"
"who"
"money_back"
"obvious"
"to_perfection"
"as_good"
"not_be"
"about_as"
"bore"
"ashamed"
"surprising"
"meets"
"of_human"
"good_idea"
"ways"
"effort"
"moronic"
"tries_to_be"
"camera"
"believable"
"contrast"
"so_called"
"for_free"
"would_love_to"
"frank"
"contrived"
"chilling"
"splendid"
"brought"
"beautiful_film"
"pretentious"
"first_of_all"
"for_those"
"dreck"
"ripped"
"neither"
"creates"
"become"
"unintentional"
"appreciated"
"touches"
"steals"
"gripping"
"continuity"
"performances_from"
"not_watch_this"
"vhs"
"potential"
"saw_this"
"fresh"
"below"
"get"
"certainly"
"just_stupid"
"mystery_science"
"should_never"
"disaster"
"episodes"
"at_first"
"sometimes"
"disjointed"
"ugly"
"doing"
"shoot"
"far_too"
"project"
"9_out_of_10"
"you'd"
"very_disappointed"
"not_very_good"
"what_thinking"
"just_didn't"
"spectacular"
"provides"
"trite"
"bad_writing"
"only_saving"
"to_be_missed"
"original"
"traditional"
"below_average"
"9"
"producers"
"late"
"fell_asleep"
"surprisingly"
"steals_show"
"as_good_as"
"first_place"
"genius"
"b_movie"
"may"
"no_story"
"recently"
"freedom"
"paint_dry"
"paper"
"shows_how"
"ever"
"not_perfect"
"chance"
"others"
"not_to_be_missed"
"jean"
"explained"
"cardboard"
"alright"
"delivers"
"two_hours"
"also_good"
"2_out_of"
"see"
"surreal"
"cast_excellent"
"impact"
"sense_of"
"year_olds"
"easy_to"
"for_this"
"yawn"
"ruined"
"appreciate"
"on_on"
"2_out"
"thanks"
"season"
"stinks"
"just_right"
"one_of_funniest"
"doesn't_make"
"why_do"
"doesn't_help"
"care"
"otherwise"
"cash_in"
"made_no_sense"
"toilet"
"dud"
"compelling"
"tender"
"together"
"thin"
"nevertheless"
"to_act"
"easy"
"care_about"
"won't_be_disappointed"
"to_video"
"about_only"
"minutes_or"
"but_then"
"lacking"
"incomprehensible"
"don't_believe"
"captivating"
"grade_d"
"to_believe"
"be_comedy"
"too_many"
"mention"
"on_edge_of"
"wanted_to_like"
"happy"
"captured"
"bit_too"
"of_this_movie"
"familiar"
"definitely_recommend"
"performances_by"
"way_too_long"
"scientist"
"not_recommended"
"screaming"
"soundtrack"
"embarrassment"
"can't_wait"
"actors"
"love_to_see"
"any_real"
"greater"
"performances_of"
"sees"
"excellently"
"can_relate"
"rewarding"
"movie_could_been"
"reality"
"this_junk"
"innocent"
"stock_footage"
"future"
"insipid"
"this_best"
"bottom_of"
"yet"
"walked"
"one_dimensional"
"light"
"seems"
"touched"
"blood"
"deserve"
"if_director"
"very_moving"
"repetitive"
"in_opinion"
"international_film"
"stick_to"
"be_one_of_best"
"really_wanted"
"to_believe_that"
"no_chemistry"
"very_best"
"of_clichés"
"looking"
"nor"
"for_anyone_who"
"so_real"
"dimensional"
"surprised"
"raw"
"power_of"
"all_great"
"this_movie_had"
"great_to_see"
"not_very"
"naked"
"like_watching"
"of_fun"
"wonder"
"embarrassingly"
"not_enough_to"
"disappointed"
"this_gem"
"story_told"
"sadly"
"stunk"
"matthau"
"film_excellent"
"hated"
"even_better"
"plastic"
"bin"
"but_even"
"muddled"
"wretched"
"be_seen"
"all_time"
"desire"
"layered"
"sensitive"
"bit"
"on_plus_side"
"sub_par"
"at_best"
"pleasure"
"must_for"
"best_of_all"
"everyone_should"
"miscast"
"thrown"
"past"
"watchable"
"unrealistic"
"what_point_of"
"felt_like"
"watch_again_again"
"inspiring"
"good_job"
"explores"
"witty"
"remake"
"value"
"better_to_do"
"had_high"
"courage"
"i'm_afraid"
"lackluster"
"relate_to"
"funny_or"
"lifeless"
"spent_on"
"does_nothing"
"fell_in_love"
"other_than"
"unintentionally"
"comedies"
"release"
"as_ever"
"french"
"love_to"
"movie_excellent"
"be_worth"
"not_much"
"something_better"
"just_too"
"abomination"
"but_still"
"tense"
"still_great"
"interesting_but"
"older"
"to_all"
"unfortunately_this"
"brutal"
"paint"
"say_about"
"did_this"
"wow"
"badly_acted"
"downhill_from"
"film_for"
"holds_up"
"delicious"
"watch_again"
"but_why"
"once"
"positive"
"contrast_to"
"f"
"wrenching"
"twists"
"only_positive"
"numbing"
"dreams"
"landscape"
"better_off"
"seagal"
"walking_around"
"seat"
"shelf"
"believe_that"
"accent"
"subtitles"
"really_liked"
"side_of"
"call_that"
"to_work_with"
"without_any"
"vision_of"
"could_been_good"
"first_off"
"revolting"
"no_purpose"
"tired"
"in_united"
"thought_provoking"
"how_well"
"chick"
"murder"
"devoid_of"
"ended_up"
"in_lives"
"doing_in_this"
"nothing_good"
"quiet"
"from_outer_space"
"read_book"
"louis"
"effectively"
"forwarding"
"really_disappointed"
"twists_turns"
"animated"
"problem_with_this"
"been_much"
"consequences"
"unlikeable"
"biggest_problem"
"lacked"
"adorable"
"even_close"
"not_make"
"coherent"
"inappropriate"
"harry"
"be_disappointed"
"little_film"
"could_been_so_much"
"run_around"
"strength"
"engrossing"
"absorbing"
"immensely"
"devastating"
"great_show"
"if_had"
"it's_one"
"next_time"
"going_to"
"joy_to_watch"
"sure_to"
"no_wonder"
"too_much"
"of_life_back"
"just_doesn't_work"
"does_not_work"
"awe"
"promising"
"worth_seeing"
"based_on_true_story"
"main_problem"
"director"
"on_earth"
"wouldn't_recommend"
"very_little"
"some_guy"
"isn't_funny"
"blend_of"
"be_avoided"
"reason_for"
"thumbs_up"
"give_3"
"this_very_good"
"pleased"
"die"
"still_love"
"back_in"
"of_zombies"
"stilted"
"hideous"
"make_out"
"money_to_see"
"confusing"
"on_true"
"in_grave"
"turd"
"nothing_better_to"
"this_dull"
